# Михлин Б.С. Решение способом А. Кабанова
# 1921.105

def f(a, b, c, m): # a, b - колич. камей в 1-й и 2-й куче, c - счетчик ходов
    if a + b >= 259:
        return c % 2 == m % 2
    if c == m:
        return 0
    h = [f(a + 1, b, c + 1, m), f(a * 2, b, c + 1, m), f(a, b + 1, c + 1, m),
         f(a, b * 2, c + 1, m)]
    #return any(h) if (c + 1) % 2 == m % 2 else any(h) # для № 19
    return any(h) if (c + 1) % 2 == m % 2 else all(h) # для № 20, 21

for b in range(1, 242):
    for m in range(1, 5):
        if f(17, b, 0, m):
            print(b, m)  # Ответ: № 19: 61; № 20: 112, 120; № 21: 111
            break
'''
№ 19:
...
60 3
61 2  № 19
62 2
...
№ 20, 21:
111 4 № 21
112 3 № 20
119 4
120 3 № 20
121 1
...
'''
