Задание:
Исполнитель преобразует число на экране. У исполнителя есть две команды, которым присвоены номера:
1. Прибавить 1
2. Прибавить 2
3. Умножить на 2
Первая команда увеличивает число на экране на 1, вторая увеличивает его на 2, третья умножает на 2. Программа для исполнителя Июнь21 – это последовательность команд. Сколько существует программ, для которых при исходном числе 3 результатом является число 14 и при этом траектория вычислений содержит число 10 и 12?


Решение:
def f(x, y):
    if x == y:
        return 1
    if x > y:
        return 0
    return f(x + 1, y) + f(x + 2, y) + f(x * 2, y)

print(f(3, 10) * f(10, 12) * f(12, 14))


Правильный ответ: 120