Задание:
Исполнитель Кантата преобразует число на экране.
У исполнителя есть три команды, которым присвоены номера:
1.     Прибавить 1
2.     Умножить на 2
3.     Умножить на 3
 
Первая команда увеличивает число на экране на 1, вторая умножает его на 2, третья умножает его на 3. Программа для исполнителя Кантата – это последовательность команд.
Сколько существует программ, для которых при исходном числе 5 результатом является число 43 и при этом траектория вычислений содержит число 9, но не содержит число 27?

Траектория вычислений программы – это последовательность результатов выполнения всех команд программы. Например, для программы 123 при исходном числе 7 траектория будет состоять из чисел 8, 16, 48.


Решение:
def f(x, y):
    if x == y:
        return 1
    if x > y or x == 27:
        return 0
    if x < y:
        return f(x + 1, y) + f(x * 2, y) + f(x * 3, y)

print(f(5, 9) * f(9, 43))


Правильный ответ: 19