Задание:
Исполнитель преобразует число на экране. У исполнителя есть две команды, которым присвоены номера:
1. Прибавить 1
2. Прибавить 2
3. Умножить на 3
Первая команда увеличивает число на экране на 1, вторая увеличивает его на 2, третья умножает на 3. Программа для исполнителя Июнь21 – это последовательность команд. Сколько существует программ, для которых при исходном числе 2 результатом является число 19 и при этом траектория вычислений содержит число 9 и не содержит числа 12?


Решение:
def f(x, y):
    if x == y:
        return 1
    if x > y or x == 12:
        return 0
    return f(x + 1, y) + f(x + 2, y) + f(x * 3, y)

print(f(2, 9) * f(9, 19))


Правильный ответ: 650