Задание:
Исполнитель В16 преобразует число, записанное на экране.
У исполнителя есть три команды, которым присвоены номера:
1.     Прибавить 1
2.     Прибавить 2
3.     Умножить на 3

Первая из них увеличивает число на экране на 1, вторая увеличивает его на 2, третья умножает его на 3.
Программа для исполнителя В16 – это последовательность команд.

Сколько существует таких программ, которые исходное число 2 преобразуют в число 14, и при этом траектория вычислений программы содержит число 10?

Траектория вычислений программы – это последовательность результатов выполнения всех команд программы. Например, для программы 132 при исходном числе 7 траектория будет состоять из чисел 8, 24, 26.


Решение:
def f(x, y):
    if x == y:
        return 1
    if x > y:
        return 0
    if x < y:
        return f(x + 1, y) + f(x + 2, y) + f(x * 3, y)

print(f(2, 10) * f(10, 14))


Правильный ответ: 200