Задание:
Исполнитель преобразует число на экране. У исполнителя есть две команды, которым присвоены номера:
1. Прибавить 1
2. Умножить на 2
3. Умножить на 3
Первая команда увеличивает число на экране на 1, вторая умножает его на 2.
Программа для исполнителя Июнь21 – это последовательность команд. Сколько существует программ, для которых при исходном числе 2 результатом является число 39 и при этом траектория вычислений содержит число 15 и не содержит числа 27?


Решение:
def f(x, y):
    if x == y:
        return 1
    if x > y or x == 27:
        return 0
    return f(x + 1, y) + f(x * 2, y) + f(x * 3, y)

print(f(2, 15) * f(15, 39))


Правильный ответ: 105