Задание:
Вася составляет 6-буквенные слова, в которых встречаются только буквы Л, М, Н, причём буква Л появляется ровно 1 раз.  Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?


Решение:
word = 'ЛМН'
k = 0
for x1 in word:
    for x2 in word:
         for x3 in word:
             for x4 in word:
                for x5 in word:
                    for x6 in word:
                        s = x1 + x2 + x3+ x4+ x5 + x6
                        if s.count('Л') == 1:
                            k += 1
print(k)


Правильный ответ: 192