Задание:
Определите количество семизначных чисел, записанных в девятиричной системе счисления, в записи которых ровно одна цифра 8, при этом числа не начинаются с нечетных цифр и не оканчиваются четными цифрами.


Решение:
from itertools import *
k = 0
for i in product("012345678", repeat = 7):
    if i.count('8') == 1 and i[0] not in '1357' and i[-1] not in '02468' and i[0] != '0':
         k += 1
print(k)


Правильный ответ: 376832