Задание:
Все 4-буквенные слова, в составе которых могут быть только буквы Л, Е, М, У, Р, записаны в алфавитном порядке и пронумерованы, начиная с 1.
Ниже приведено начало списка.
1.  ЕЕЕЕ
2.  ЕЕЕЛ
3.  ЕЕЕМ
4.  ЕЕЕР
5.  ЕЕЕУ
6.  ЕЕЛЕ
…
Под каким номером в списке идёт первое слово, которое начинается с буквы Л?


Решение:
import itertools
k = 0
for s in list(itertools.product('ЕЛМРУ', repeat=4)):
    k += 1
    if s[0] == 'Л':
        print(k)
        break


Правильный ответ: 126