Задание:
Все 4-буквенные слова, в составе которых могут быть только буквы А, И, О, У, Э, записаны в алфавитном порядке и пронумерованы.
Вот начало списка:
1.  АААА
2.  АААИ
3.  АААО
4.  АААУ
5.  АААЭ
……
Под каким номером стоит слово ИЭУЭ?


Решение:
import itertools
k = 0
for s in list(itertools.product('АИОУЭ', repeat=4)):
    k += 1
    if ''.join(s) == 'ИЭУЭ':
        print(k)
        break


Правильный ответ: 245