Задание:
Вася составляет 4-буквенные слова, в которых встречаются только буквы Д, Е, Ж, З, причём буква Д появляется ровно 1 раз.  Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?


Решение:
word = 'ДЕЖЗ'
k = 0
for x1 in word:
    for x2 in word:
         for x3 in word:
             for x4 in word:
                s = x1 + x2 + x3+ x4
                if s.count('Д') == 1:
                    k += 1
print(k)


Второй вариант решения:
from itertools import *
k = 0
for i in product("ДЕЖЗ", repeat = 4):
    if i.count('Д') == 1:
         k += 1
print(k)


Правильный ответ: 108