Задание:
Вася составляет 5-буквенные слова, в которых встречаются только буквы А, Б, В, Г, причём буква А появляется ровно 1 раз.  Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?


Решение:
word = 'АБВГ'
k = 0
for x1 in word:
    for x2 in word:
         for x3 in word:
             for x4 in word:
                for x5 in word:
                    s = x1 + x2 + x3+ x4 + x5
                    if s.count('А') == 1:
                        k += 1
print(k)


Второй вариант решения
from itertools import *
k = 0
for i in product("АБВГ", repeat = 5):
    if i.count('А') == 1:
         k += 1
print(k)


Правильный ответ: 405