Задание:
Вася составляет 6-буквенные слова, в которых могут быть использованы только буквы В, И, Ш, Н, Я, причём буква В используется не более одного раза. Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Слово не должно начинаться с буквы Ш и оканчиваться гласными буквами. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?


Решение:
glas = 'ИЯ'
sogl = 'ВШН'
word = 'ВИШНЯ'
k = 0
for x1 in word:
    for x2 in word:
         for x3 in word:
             for x4 in word:
                for x5 in word:
                    for x6 in word:
                        s = x1 + x2 + x3+ x4 + x5 + x6
                        if s.count('В') <= 1 and s[0] != 'Ш' and s[-1] not in glas:
                            k += 1

print(k)


Второй вариант решения:
from itertools import *
glas = 'ИЯ'
sogl = 'ВШН'
 
k = 0
for i in product("ВИШНЯ", repeat = 6):
    if i[0] != 'Ш' and i[5] not in glas and i.count('В') <= 1:
         k += 1
print(k)


Правильный ответ: 4352