Задание:
Игорь составляет таблицу кодовых слов для передачи сообщений, каждому сообщению соответствует своё кодовое слово. В качестве кодовых слов Игорь использует 5-буквенные слова, в которых есть только буквы П, И, Р, причём буква П появляется ровно 1 раз.  Каждая из других допустимых букв может встречаться в кодовом слове любое количество раз или не встречаться совсем. Сколько различных кодовых слов может использовать Игорь.


Решение:
word = 'ПИР'
k = 0
for x1 in word:
    for x2 in word:
         for x3 in word:
             for x4 in word:
                for x5 in word:
                    s = x1 + x2 + x3+ x4 + x5
                     if s.count('П') == 1:
                        k += 1
print(k)


Второй вариант решения:
from itertools import *
k = 0
for i in product("ПИР", repeat = 5):
    if i.count('П') == 1:
         k += 1
print(k)


Правильный ответ: 80