Задание:
Вася составляет 5-буквенные слова, в которых встречаются только буквы Ж, З, И, причём буква Ж появляется ровно 1 раз.  Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?


Решение:
import itertools
k = 0
for s in list(itertools.product('ЖЗИ', repeat=5)):
    if s.count("Ж") == 1:
        k += 1
print(k)

Правильный ответ: 80