Задание:
Вася составляет 4-буквенные слова, в которых встречаются только буквы З, И, К, Л, М, Н, причём буква З появляется ровно 1 раз.  Каждая из других допустимых букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?


Решение:
import itertools
k = 0
for s in list(itertools.product('ЗИКЛМН', repeat=4)):
    if s.count("З") == 1:
        k += 1
print(k)


Правильный ответ: 500