Задание:
Исполнитель Редактор получает на вход строку цифр и преобразовывает её. Редактор может выполнять две команды, в обеих командах v и w обозначают цепочки цифр.
А) заменить (v, w).
Эта команда заменяет в строке первое слева вхождение цепочки v на цепочку w. Например, выполнение команды
заменить (111, 27)
преобразует строку 05111150 в строку 0527150.
Если в строке нет вхождений цепочки v, то выполнение команды
заменить (v, w)
не меняет эту строку.
Б) нашлось (v).
Эта команда проверяет, встречается ли цепочка v в строке исполнителя Редактор. Если она встречается, то команда возвращает логическое значение «истина», в противном случае возвращает значение «ложь». Строка исполнителя при этом не изменяется.

Цикл
    ПОКА условие
    последовательность команд
    КОНЕЦ ПОКА
выполняется, пока условие истинно.
В конструкции
    ЕСЛИ условие
        ТО команда1
        ИНАЧЕ команда2
    КОНЕЦ ЕСЛИ
выполняется команда1 (если условие истинно) или команда2 (если условие ложно).

Какая строка получится в результате применения приведенной программы к строке, состоящей из 81 идущих подряд цифр 9?
НАЧАЛО
    ПОКА нашлось (33333) или нашлось(999)
        ЕСЛИ нашлось (33333)
            ТО заменить (33333, 99)
            ИНАЧЕ заменить (999, 3)
        КОНЕЦ ЕСЛИ
    КОНЕЦ ПОКА
КОНЕЦ


Решение:
s = '9' * 81
while '33333' in s or '999' in s:
   if '33333' in s:
       s = s.replace('33333','99',1)
   else:
       s = s.replace('999','3',1)
print(s)


Правильный ответ: 3