Задание:
Исполнитель Редактор получает на вход строку цифр и преобразовывает её. Редактор может выполнять две команды,
в обеих командах v и w обозначают цепочки цифр.
А) заменить (v, w).
Эта команда заменяет в строке первое слева вхождение цепочки v на цепочку w. Например, выполнение команды 
заменить (111, 27) 
преобразует строку 05111150 в строку 0527150. 
Если в строке нет вхождений цепочки v, то выполнение команды 
заменить (v, w) 
не меняет эту строку.
Б) нашлось (v).
Эта команда проверяет, встречается ли цепочка v в строке исполнителя Редактор. Если она встречается, то команда возвращает логическое значение «истина», в противном случае возвращает значение «ложь». Строка исполнителя при этом не изменяется.

Цикл
ПОКА  условие  
последовательность команд 
КОНЕЦ ПОКА
выполняется, пока условие истинно.
В конструкции
ЕСЛИ  условие
ТО команда1
ИНАЧЕ команда2
КОНЕЦ ЕСЛИ
выполняется команда1 (если условие истинно) или команда2 (если условие ложно).


Дана программа для Редактора:
НАЧАЛО
ПОКА нашлось (25) ИЛИ нашлось (355) ИЛИ нашлось (555)
       ЕСЛИ нашлось (25)
       ТО заменить (25, 5)
       КОНЕЦ ЕСЛИ
       ЕСЛИ нашлось (355)
       ТО заменить (355, 52)
       КОНЕЦ ЕСЛИ
       ЕСЛИ нашлось (555)
       ТО заменить (555, 3)
       КОНЕЦ ЕСЛИ
КОНЕЦ ПОКА
КОНЕЦ 

На вход приведённой выше программе поступает строка, которая в начале содержит k цифр «2», а затем n цифр «5»
(k > 4, n > 4).

Определите наименьшую сумму значений n и k, при которой в строке, получившейся в результате выполнения программы, есть цифры 2, 3 и 5, и количество цифр «2» четно.


Решение:
minznach = 50000
for n in range(5, 100):
    for k in range(5, 50):
         s = '2' * k + '5' * n
        while '25' in s or '355' in s or '555' in s:
             if '25' in s:
                s = s.replace('25', '5', 1)
             if '355' in s:
                s = s.replace('355', '52', 1)
             if '555' in s:
                s = s.replace('555', '3', 1)
         if '2' in s and s.count('2') % 2 == 0 and '3' in s and '5' in s:
             minznach = min(minznach, n+k)

print(minznach)


Правильный ответ: 33