Задание:
Напишите программу, которая перебирает целые числа, бо́льшие 500 000, в порядке возрастания и ищет среди них такие, у которых есть натуральный делитель, оканчивающийся на цифру 8 и не равный ни самому числу, ни числу 8.

Для каждого из пяти таких найденных чисел сначала выводится само число, затем – значение наименьшего делителя, оканчивающегося на цифру 8, не равного ни самому числу, ни числу 8.

Формат ответа: число наименьший_дел число наименьший_дел...


Решение:
c, i = 0, 500002  
while c < 5:  
    for d in range(18, i, 10):  
        if i % d == 0:  
            c += 1  
            print(i, d, end = '')  
            break  
    i += 2


Правильный ответ: 500002 178 500004 18 500016 48 500018 58 500020 4348