Задание:
Напишите программу, которая перебирает целые числа, большие 600000, в порядке возрастания и ищет среди них такие, среди делителей которых есть числа,
оканчивающиеся на 7, но не равные 7 и самому числу. Необходимо вывести первые 5 таких чисел, и наименьший делитель, оканчивающийся на 7, не равный 7 и
самому числу. Формат вывода: для каждого из 5 таких найденных чисел в отдельной строке сначала выводится само число, затем — наименьший делитель, оканчивающийся на 7, не равный 7 и самому числу. Строки выводятся в порядке возрастания найденных чисел. Количество строк в таблице для ответа избыточно.

Ответ вводи через пробел, число мин_делитель…


Решение:
k = 0
for i in range(600001, 100000000):
    for d in range(1, i):
        if i % d == 0 and d % 10 == 7 and d != 7:
            k += 1
            print(i, d)
            break
    if k == 5:
        break


Правильный ответ: 600001 437 600002 47 600003 1227 600005 217 600012 16667