Задание:
Назовём маской числа последовательность цифр, в которой также могут встречаться следующие символы:
–      символ «?» означает ровно одну произвольную цифру;
–      символ «*» означает любую последовательность цифр произвольной длины; в том числе «*» может задавать и пустую последовательность.
Например, маске 123*4?5 соответствуют числа 123405 и 12300405.
Среди натуральных чисел, не превышающих 109, найдите все числа, соответствующие маске 12345?7?8, делящиеся на число 31 без остатка.
В ответе запишите все найденные числа и соответствующие им результаты деления этих чисел на 31 в порядке возрастания.

Формат ответа: число частное число частное…


Решение:
for i in range(10):
    for j in range(10):
        x = 123450708 + i * 1000 + j * 10
        if x % 31 == 0:
            print(x, x // 31, end=' ')


Правильный ответ: 123452788 3982348 123453718 3982378 123457748 3982508