Задание:
Назовём маской числа последовательность цифр, в которой также могут встречаться следующие символы:
— символ «?» означает ровно одну произвольную цифру;
— символ «*» означает любую последовательность цифр произвольной длины; в том числе «*» может задавать и пустую последовательность.
Например, маске 123*4?5 соответствуют числа 123405 и 12300405.

Среди натуральных чисел, не превышающих 10**8, найдите все числа, соответствующие маске 12??46*1,, делящиеся на 273 без остатка. В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, а во втором столбце  — соответствующие им результаты деления этих чисел на 273.


Решение:
for i in range(273,10**8+1,273):
    s=str(i)
    if s[:2]=='12' and s[4:6]=='46' and s[-1]=='1':
        print(i,i//273)


Правильный ответ: 12704601 46537 12734631 46647 12764661 46757 12794691 46867