Задание:
Назовём маской числа последовательность цифр, в которой также могут встречаться следующие символы:
— символ «?» означает ровно одну произвольную цифру;
— символ «*» означает любую последовательность цифр произвольной длины; в том числе «*» может задавать и пустую последовательность.
Например, маске 123*425 соответствуют числа 123405 и 12300405. Среди натуральных чисел, не превышающих 10^8, найдите все числа, соответствующие маске 2*1?71, делящиеся на 1991 без остатка. В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, а во втором столбце — соответствующие результаты деления этих чисел на 1991.


Решение:
from fnmatch import *
for i in range(0, 10**8, 1991):
 if fnmatch(str(i), '2*1?71'):
   print(i, i//1991)


Правильный ответ: 2351371 1181 20071271 10081 22261371 11181 24451471 12281 26641571 13381 28831671 14481