Задание:
Назовём маской числа последовательность цифр, в которой также могут встречаться следующие символы:
— символ «?» означает ровно одну произвольную цифру;
— символ «*» означает любую последовательность цифр
произвольной длины; в том числе «*» может задавать
и пустую последовательность.

Например, маске 123*425 соответствуют числа 123405 и 12300405.
Среди натуральных чисел, не превышающих 10^8, найдите все числа, соответствующие маске 3?1*57, делящиеся на 3123 без остатка.
В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, а во втором столбце — соответствующие результаты деления этих чисел на 3123.

Решение:
from fnmatch import *
for i in range(0, 10**8, 3123):
  if fnmatch(str(i), '3?1*57'):
    print(i, i//3123)


Правильный ответ: 3619557 1159 30165057 9659 31101957 9959 35161857 11259