Задание:
Напишите программу, которая перебирает целые числа, бо́льшие 700 000, в порядке возрастания и ищет среди них такие, у которых есть натуральный делитель, оканчивающийся на цифру 9 и не равный ни самому числу, ни числу 9.

Для каждого из пяти таких найденных чисел сначала выводится само число, затем – значение наименьшего делителя, оканчивающегося на цифру 9, не равного ни самому числу, ни числу 9.

Формат ответа: число наименьший_дел число наименьший_дел...


Решение:
c, i = 0, 700001  
while c < 5:  
    for d in range(19, i, 10):  
        if i % d == 0:  
            c += 1  
            print(i, d, end = '')  
            break  
    i += 1  


Правильный ответ: 700002 29 700003 18919 700004 139 700005 69 700011 39

