Задание:
Пусть M – сумма минимального и максимального натуральных делителей целого числа, не считая единицы и самого числа. Если таких делителей у числа нет, то считаем значение M равным нулю.

Напишите программу, которая перебирает целые числа, бо́льшие 900 000, в порядке возрастания и ищет среди них такие, для которых значение M оканчивается на 8. Программа должна найти и вывести первые пять таких чисел и соответствующие им значения M.

Для каждого из пяти таких найденных чисел сначала выводится само число, затем – значение М. Строки выводятся в порядке возрастания найденных чисел.

Например, для числа 20 М = 2 + 10 = 12.

Формат ответа: число значение_м число значение_м...


Решение:
c, i = 0, 900001  
while c < 5:  
    for d in range(2, int(i**0.5) + 1):  
        if i % d == 0:  
            if (d + i // d) % 10 == 8:  
                c += 1  
                print(i, d + i // d, end = '')  
                break  
    i += 1  


Правильный ответ: 900012 450008 900015 300008 900032 450018 900041 2358 900045 300018