Задание:
Пусть M – сумма минимального и максимального натуральных делителей целого числа, не считая единицы и самого числа. Если таких делителей у числа нет, то считаем значение M равным нулю.

Напишите программу, которая перебирает целые числа, бо́льшие 800 000, в порядке возрастания и ищет среди них такие, для которых значение M оканчивается на 6. Программа должна найти и вывести первые пять таких чисел и соответствующие им значения M.

Для каждого из пяти таких найденных чисел сначала выводится само число, затем – значение М. Строки выводятся в порядке возрастания найденных чисел.

Например, для числа 20 М = 2 + 10 = 12.

Формат ответа: число значение_м число значение_м...


Решение:
c, i = 0, 800001  
while c < 5:  
    for d in range(2, int(i**0.5) + 1):  
        if i % d == 0:  
            if (d + i // d) % 10 == 6:  
                c += 1  
                print(i, d + i // d, end=' ')  
                break  
    i += 1  


Правильный ответ: 800003 47076 800005 160006 800008 400006 800019 266676 800023 114296