Задание:
Обозначим через М сумму максимального и минимального делителей числа (за исключением единицы и самого числа). Если такую сумму получить не удаётся (если число делится только на себя и на единицу), то значение M следует считать равным нулю. Найдите на промежутке от 900 000 не включительно до бесконечности первые пять чисел, для которых значение M будет оканчиваться на 8.

Ответ вводи через пробел, число М…


Решение:
def del(n):
    s = 0
    d = 2
    while d * d <= n:
        if n % d == 0:
            s = d + n // d
            break
        d += 1
    if s != 0 and s % 10 == 8:
        return s
    else:
        return 0

k = 0
for i in range(900001, 100000000):
    d = del(i)
    if d != 0:
        k += 1
        print(i, d)
    if k == 5:
        break


Правильный ответ: 900012 900015 900032 900041 900045