Задание:
Рассматриваются числа большие 500000, у которых есть натуральные делители. Найдите первые 5 чисел, у которых среди делителей будет число оканчивающееся на 9, но при этом он не равен самому числу или 9. В ответ запишите сначала число, затем его наименьший делитель оканчивающийся на 9. Ответ записывайте в порядке возрастания найденных чисел.

Ответ вводи через пробел, число мин_делитель…


Решение:
k = 0
for i in range(500001, 100000000):
    for d in range(1, i):
        if i % d == 0 and d % 10 == 9 and d != 9:
            k += 1
            print(i, d)
            break
    if k == 5:
        break


Правильный ответ: 500002 89 500003 71429 500004 19 500007 166669 500013 18519