Задание:
Сколько единиц содержится в двоичной записи значения выражения: 4^2015+2^2016−5?

Решение:
n = 4 ** 2015 + 2 ** 2016 - 5  
k = 0  
while n > 0:  
    if n % 2 == 1:  
        k += 1  
    n = n // 2  
print(k)


Правильный ответ: 2016