Задание:
Операнды арифметического выражения записаны в системе счисления с основанием 16: 135xF+9x531
В записи чисел переменной х обозначена неизвестная цифра из алфавита 16-ричной системы счисления. Определите наименьшее значение х, при котором значение данного арифметического выражения кратно 8. Для найденного значения х вычислите частное от деления значения арифметического выражения на 8 и укажите его в ответе в десятичной системе счисления. Основание системы счисления в ответе указывать не нужно


Решение:
for x in '0123456789ABCDEF':
   m = int('135'+x+'F', 16)
   n = int('9'+x+'531', 16)
   if (m+n)%8 == 0:
       print((m+n)//8)


Правильный ответ: 83784