Задание:
Операнды арифметического выражения записаны в системе счисления с основанием 15: 97968х13+7x233
В записи чисел переменной x обозначена неизвестная цифра из алфавита 15-ричной системы счисления. Определите наибольшее значение x, при котором значение данного арифметического выражения кратно 14. Для найденного значения x вычислите частное от деления значения арифметического выражения на 14 и укажите его в ответе в десятичной системе счисления. Основание системы счисления в ответе указывать не нужно.


Решение:
for x in '0123456789ABCDE':
   m = int('97968'+x+'13', 15)
   n = int('7'+x+'233', 15)
   if (m+n)%14 == 0:
       print((m+n)//14)


Правильный ответ: 116073969