Задание:
Операнды арифметического выражения записаны в системе счисления с основанием 15: х3483491+4893x
В записи чисел переменной x обозначена неизвестная цифра из алфавита 15- ричной системы счисления. Определите наибольшее значение x, при котором значение данного арифметического выражения кратно 14.
Для найденного значения x вычислите частное от деления значения арифметического выражения на 14 и укажите его в ответе в десятичной системе счисления. Основание системы счисления в ответе указывать не нужно. 

Решение:
for x in '0123456789ABCDE':
   m = int(x+'3483491', 15)
   n = int('4893'+x, 15)
   if (m+n)%14 == 0:
       print((m+n)//14)


Правильный ответ: 173563455