Задание:
Значение арифметического выражения 5⋅216^1225+4⋅36^1256−4⋅6^1257−2023 
записали в системе счисления с основанием 6. Определите количество цифр 5 в записи этого числа.


Решение:
n = 5*216**1255 + 4*36**1256 - 4*6**1257 - 2023
k5 = 0
while n>0:
   if n%6 == 5:
       k5 += 1
   n = n//6
print (k5)


Правильный ответ: 2508