Задание:
Значение арифметического выражения 5⋅216^155+4⋅36^156−4⋅6^157−2023
записали в системе счисления с основанием 6. Определите количество значащих нулей в записи этого числа.

Решение:
n = 5*216**155 + 4*36**156 - 4*6**157 - 2023
k0 = 0
while n>0:
   if n%6 == 0:
       k0 += 1
   n = n//6
print (k0)


Правильный ответ: 152