Задание:
Значение арифметического выражения 2⋅729^1021−2⋅243^1022+81^1023−2⋅27^1024−1025
записали в системе счисления с основанием 3. Определите количество значащих нулей в записи этого числа.


Решение:
n = 2*729**1021 - 2*243**1022 + 81**1023 - 2*27**1024 - 1025
k0 = 0
while n>0:
   if n%3 == 0:
       k0 += 1
   n = n//3
print (k0)


Правильный ответ: 1021
