Задание:
Сколько единиц содержится в двоичной записи значения выражения 4^12−2^32−16?


Решение:
n = 4 ** 12 + 2 ** 32 - 16  
k = 0  
while n > 0:  
    if n % 2 == 1:  
        k += 1  
    n = n // 2  
print(k)


Правильный ответ: 21