Задание:
Сколько единиц содержится в двоичной записи значения выражения: 4^16+2^36−8?


Решение:
n = 4 ** 16 + 2 ** 36 - 8
k = 0
while n > 0:
    if n % 2 == 1:
        k += 1
    n = n // 2
print(k)


Правильный ответ: 30