Задание:
Сколько значащих нулей содержится в десятичной записи значения выражения: 100^10−10^6+100?
 

Решение:
n = 100 ** 10 - 10 ** 6 + 100
k = 0
while n > 0:
    if n % 10 == 0:
        k += 1
    n = n // 10
print(k)


Правильный ответ: 5