Задание:
Значение арифметического выражения 9^7+3^12−3 - записали в системе счисления с основанием 3. Сколько цифр «2» содержится в этой записи?


Решение:
n = 9 ** 7 + 3 ** 12 - 3
k = 0
while n > 0:
    if n % 3 == 2:
        k += 1
    n = n // 3
print(k)


Правильный ответ: 11