Задание:
Значение арифметического выражения 25^5+5^15−25 - записали в системе счисления с основанием 5. Сколько цифр «4» содержится в этой записи?


Решение:
n = 25 ** 5 + 5 ** 15 - 25
k = 0
while n > 0:
    if n % 5 == 4:
        k += 1
    n = n // 5
print(k)


Правильный ответ: 8