Задание:
Алгоритм вычисления значения функции F(n), где n – натуральное число, задан следующими рекуррентными соотношениями:
F(n) = 1 при n = 1;
F(n) = F(n − 1) × n при n ≥ 2.

Чему равно значение функции F(6)? В ответе запишите только натуральное число.


Решение:
def F(n):
    if n == 1:
        return 1
    elif n >= 2:
        return F(n - 1) * n
print(F(6))


Правильный ответ: 720