Задание:
Алгоритм вычисления значения функции F(n), где n – натуральное число, задан следующими соотношениями:
F(n) = 2 при n ≤ 2;
F(n) = F(n − 1) + 2 × F(n − 2) при n > 2.

Чему равно значение функции F(5)? В ответе запишите только натуральное число.
 

Решение:
def F(n):
    if n <= 2:
        return 2
    elif n > 2:
        return F(n - 1) + 2 * F(n - 2)
print(F(5))


Правильный ответ: 22