Задание:
Алгоритм вычисления значения функции F(n), где n – натуральное число, задан следующими соотношениями:
F(n) = n + 1 при n ≤ 2;
F(n) = F(n − 1) + 2 × F(n − 2) при n > 2.

Чему равно значение функции F(4)? В ответе запишите только натуральное число.


Решение:
def F(n):
    if n <= 2:
        return n + 1
    elif n > 2:
        return F(n - 1) + 2 * F(n - 2)
print(F(4))


Правильный ответ: 13