Задание:
На вход алгоритма подается натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1. Строится двоичная запись числа N.
2. К этой записи записываются справа ещё два разряда по следующему правилу:
а) складываются все цифры двоичной записи, и остаток от деления суммы на 2 дописывается в конец числа (справа). Например, запись 11100 преобразуется в запись 111001;
б) над этой записью производятся те же действия – справа дописывается остаток от деления суммы цифр на 2.
Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R.
Укажите такое наименьшее число N, для которого результат работы алгоритма больше 105. В ответе это число запишите в десятичной системе счисления.


Решение:
for n in range(1,100):
   n2 = bin(n)[2:]
   if n2.count('1') % 2 == 0:                                  
       n2 += '0'
   else:
       n2 += '1'
   if n2.count('1') % 2 == 0:
       n2 += '0'
   else:
       n2 += '1'
   r = int(n2,2)
   if r > 105:
       print(n)
       break


Правильный ответ: 26