Задание:
На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число следующим образом.
1) Строится двоичная запись числа N.
2) К этой записи дописываются справа ещё два разряда по следующему правилу: 
если N чётное, в конец числа (справа) дописываются два нуля, в противном случае справа дописываются две единицы. 
Например, двоичная запись 1001 числа 9 будет преобразована в 100111. 
Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью числа – результата работы данного алгоритма.
Укажите максимальное число N, для которого результат работы алгоритма будет меньше 131. В ответе это число запишите в десятичной системе счисления


Решение:
for n in range(1, 100):
    n2 = bin(n)[2:]
    if n % 2 == 0:
        n2 = n2 + '00'
    else:
        n2 = n2 + '11'
    R = int(n2,2)
    if R < 131:
        print(n)


Правильный ответ: 32